U-bend_0/system/controlDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	controlDict;
}

libs (
      "libOpenFOAM.so"
      "libsimpleSwakFunctionObjects.so"
      "libswakFunctionObjects.so"
      "libgroovyBC.so"
     );

application	simpleFoam;
startFrom	latestTime;
startTime	0;
stopAt	endTime;
endTime	10000.0;
deltaT	1.0;
writeControl	timeStep;
writeInterval	10.0;
purgeWrite	2;
timeFormat	general;
timePrecision	6;
writeFormat	ascii;
writePrecision	7;
writeCompression	uncompressed;
runTimeModifiable	true;

functions
{
	findPoint_detachment1 
	{
		type swakExpression;
		verbose false;
		valueType patch;
		patchName detachment1;
		expression "sqrt(pow(internalField(U).x,2)+pow(internalField(U).y,2))<1 ? pos().x : 0";
		accumulations (			
			min
		);
	}

	findPoint_detachment2 
	{
		type swakExpression;
		verbose false;
		valueType patch;
		patchName detachment2;
		expression "sqrt(pow(internalField(U).x,2)+pow(internalField(U).y,2))<1 ? pos().x : 0.999";
		accumulations (			
			max
		);
	}
    
}
