U-bend_0/system/blockMeshDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	blockMeshDict;
}
convertToMeters	1;
edges	
(
);
vertices	
(
	(-0.5 -0.5 -0.5)
	(0.5 -0.5 -0.5)
	(0.5 0.5 -0.5)
	(-0.5 0.5 -0.5)
	(-0.5 -0.5 0.5)
	(0.5 -0.5 0.5)
	(0.5 0.5 0.5)
	(-0.5 0.5 0.5)
);
blocks	
(
	hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1.0 1.0 1.0)
);
boundary	
(
		boundaries
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(2 6 5 1)
			(1 5 4 0)
			(3 7 6 2)
			(0 3 2 1)
			(4 5 6 7)
		);
	}

);
