U-bend_0/constant/transportProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	transportProperties;
}
transportModel	Newtonian;
nu	nu [0 2 -1 0 0 0 0] 1.0E-6;
