U-bend_0/0/U
FoamFile
{
	version             2.0;
	format              ascii;
	class               volVectorField;
	location            "0";
	object              U;
}


dimensions	[0 1 -1 0 0 0 0];

internalField	uniform (0.0 0.0 0.0);

boundaryField
{
	inlet
	{
		type	surfaceNormalFixedValue;
		value	uniform (0.0 0.0 0.0);
		refValue	uniform -8.8;
	}
	outlet
	{
		type	pressureInletOutletVelocity;
		value	uniform (0.0 0.0 0.0);
	}
	walls
	{
		type	noSlip;
	}
	empty
	{
		type	empty;
	}
	detachment1
	{
		type	noSlip;
	}
	detachment2
	{
		type	noSlip;
	}
}
