U-bend_0/0/p
FoamFile
{
	version             2.0;
	format              ascii;
	class               volScalarField;
	location            "0";
	object              p;
}


dimensions	[0 2 -2 0 0 0 0];

internalField	uniform 0.0;

boundaryField
{
	inlet
	{
		type	zeroGradient;
	}
	outlet
	{
		type	fixedValue;
		value	uniform 0.0;
	}
	walls
	{
		type	zeroGradient;
	}
	empty
	{
		type	empty;
	}
	detachment1
	{
		type	zeroGradient;
	}
	detachment2
	{
		type	zeroGradient;
	}
}
