U-bend_0/0/k
FoamFile
{
	version             2.0;
	format              ascii;
	class               volScalarField;
	location            "0";
	object              k;
}


dimensions	[0 2 -2 0 0 0 0];

internalField	uniform 1.0;

boundaryField
{
	inlet
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 1.0;
		intensity	0.05;
	}
	outlet
	{
		type	inletOutlet;
		inletValue	uniform 1.0;
	}
	walls
	{
		type	kqRWallFunction;
		value	uniform 1.0;
	}
	empty
	{
		type	empty;
	}
	detachment1
	{
		type	kqRWallFunction;
		value	uniform 1.0;
	}
	detachment2
	{
		type	kqRWallFunction;
		value	uniform 1.0;
	}
}
