U-bend_0/0/omega
FoamFile
{
	version             2.0;
	format              ascii;
	class               volScalarField;
	location            "0";
	object              omega;
}


dimensions	[0 0 -1 0 0 0 0];

internalField	uniform 1.0;

boundaryField
{
	inlet
	{
		type	turbulentMixingLengthFrequencyInlet;
		value	uniform 1.0;
		mixingLength	0.001;
	}
	outlet
	{
		type	inletOutlet;
		inletValue	uniform 1.0;
	}
	walls
	{
		type	omegaWallFunction;
		value	uniform 1.0;
	}
	empty
	{
		type	empty;
	}
	detachment1
	{
		type	omegaWallFunction;
		value	uniform 1.0;
	}
	detachment2
	{
		type	omegaWallFunction;
		value	uniform 1.0;
	}
}
